app/controllers/questions_controller.rb

  def show
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)

  def edit
    @question = Question.find(params[:id])
---
SELECT * FROM "questions" WHERE ("questions"."id" = 1)

  def create
    @question = Question.new(params[:question])

    respond_to do |format|
      if @question.save
---
INSERT INTO "questions" ("created_at", "author", "updated_at", "tag", "question", "answer") VALUES('2009-01-05 16:11:41', 'irvin', '2009-01-05 16:11:41', 'RoR', 'Why aren''t the views updated automatically?', 'good question')