app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES('', 'c9e35fded6a83afbb051d201199eaa8477655f6d', '2009-01-07 21:59:20', '86ff35c185effaa6db34f0963b53e0bba3df5faa', NULL, '2009-01-07 21:59:20', NULL, 'irvin', 'irvin.hwang@gmail.com')